{
  "backend/main.mo": "Main backend actor defining file handling, user profiles, activity events, authorization checks, and session storage with various utility types.",
  "backend/migration.mo": "Migration module converting old state to the new actor state by adding an empty activityEvents map.",
  "feature_evidence.json": "Feature evidence report listing implemented features with associated files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of frontend file summaries describing roles of journey components, audio system, effects, tracking, and state management.",
  "frontend/index.css": "Tailwind-based global CSS defining theme variables, dark mode overrides, and base styling.",
  "frontend/index.html": "Base HTML page loading the React app and containing metadata, manifest link, and a hidden message.",
  "frontend/public/manifest.webmanifest": "PWA manifest configuring app name, colors, start URL, and icon for installation.",
  "frontend/public/service-worker.js": "Service worker implementing basic static asset caching and fetch fallback behavior.",
  "frontend/src/admin/AdminDashboardPage.tsx": "Admin dashboard showing local and backend activity events with visitor filtering and JSON export.",
  "frontend/src/admin/AdminLoginPage.tsx": "Renders an admin login form with password input, error handling, and submit logic calling an onLogin callback.",
  "frontend/src/admin/AdminRouter.tsx": "Routes between the admin login page and dashboard based on authentication state from useAdminAuth.",
  "frontend/src/admin/auth/adminAuth.ts": "Implements session-based admin authentication with a hardcoded password and automatic timeout tracking.",
  "frontend/src/App.tsx": "Root React component initializing providers, service worker registration, music system, and router.",
  "frontend/src/audio/MusicController.tsx": "UI component for controlling music playback, volume, and expansion state using the music system hook.",
  "frontend/src/audio/MusicProvider.tsx": "Provides global music playback context with autoplay handling, track switching, volume control, and user-interaction fallbacks.",
  "frontend/src/audio/playlist.ts": "Defines available audio tracks and exports their file paths and TrackKey type.",
  "frontend/src/audio/useMusicSystem.ts": "Hook exposing simplified controls for playback, track changes, and volume via the music context.",
  "frontend/src/celebration/CelebrationPage.tsx": "Displays the celebration screen with animated effects and sets the music to the celebration track.",
  "frontend/src/easter-eggs/useEasterEggs.ts": "Adds Konami code detection, idle reminders, return notifications, and unload prompts using toast messages.",
  "frontend/src/effects/HeartParticles.tsx": "Canvas-based animated floating heart particles with adjustable intensity.",
  "frontend/src/effects/RosePetals.tsx": "Canvas animation rendering falling rose petals with configurable density and movement.",
  "frontend/src/effects/StarsOverlay.tsx": "Applies a twinkling starry background overlay with adjustable opacity levels.",
  "frontend/src/effects/VignetteGlow.tsx": "Renders a vignette-style glow overlay with variable intensity opacity.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and status handling using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for fetching and mutating activity data through the backend actor.",
  "frontend/src/index.css": "Global Tailwind setup defining fonts, theme variables, animations, and utility styles.",
  "frontend/src/journey/components/ProgressIndicator.tsx": "Displays a fixed progress bar showing the user's journey completion percentage.",
  "frontend/src/journey/components/QuestionCard.tsx": "Renders a question with selectable options and text inputs, logging submissions and sending answers upward.",
  "frontend/src/journey/JourneyRenderer.tsx": "Renders the current journey node with themed visuals, logs activity, and transitions state based on answers.",
  "frontend/src/journey/JourneyRouter.tsx": "Controls routing between landing, journey, celebration, and admin pages while managing journey state persistence.",
  "frontend/src/journey/pages/LandingPage.tsx": "Landing screen introducing the journey with animated visual effects and a start button.",
  "frontend/src/journey/proposal/noButtonMechanics.ts": "Defines behavior for the 'No' button, changing its text, size, movement, and visibility based on attempt count.",
  "frontend/src/journey/proposal/ProposalQuestion.tsx": "Renders the main proposal screen with yes/think/no mechanics, logs decisions, and updates journey state including no-attempt behavior.",
  "frontend/src/journey/proposal/ThinkFlow.tsx": "Implements a multi-step reflection flow where users enter answers, logs each step, and allows returning to the proposal.",
  "frontend/src/journey/spec/journeyScript.ts": "Defines the full journey script with nodes, questions, options, metadata, and branching logic.",
  "frontend/src/journey/state/journeyState.ts": "Declares the JourneyState interface tracking node ID, answers, progress, attempts, timings, and final decision.",
  "frontend/src/journey/state/persistence.ts": "Provides localStorage save/load/clear helpers for persisting JourneyState.",
  "frontend/src/journey/state/useAutosave.ts": "React hook that autosaves journey state on interval and on every state change.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load for PWA support.",
  "frontend/src/theme/sectionThemes.ts": "Maps journey node IDs to themed UI settings including background, particle intensities, and music tracks.",
  "frontend/src/tracking/backendQueue.ts": "Implements a local event queue with retry logic, persistence, and filtering for backend submission.",
  "frontend/src/tracking/journeyEventLogger.ts": "Logs journey events, records them locally, and enqueues them for backend submission with visitor metadata.",
  "frontend/src/tracking/sendToBackend.ts": "Flushes queued events to the backend actor with retry handling and exposes cleanup utilities.",
  "frontend/src/tracking/storage.ts": "Manages localStorage for tracking events and prepares combined export data including journey info and timestamps.",
  "frontend/src/tracking/useActivityTracker.ts": "React hook that tracks basic click and mouse-move activity tied to the current journey node.",
  "frontend/src/tracking/useBackgroundSync.ts": "React hook that periodically flushes queued tracking events to the backend and handles unload-time syncing.",
  "frontend/src/tracking/visitorId.ts": "Generates and persists a unique anonymous visitor ID in localStorage.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based query params.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON metadata describing project state, existing tracking features, and pending activity-tracking requirements."
}